Revit 2027 API
OverrideGraphicSettings.DetailLevel Property
 The detail level.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ViewDetailLevel DetailLevel { get; }
Public ReadOnly Property DetailLevel As ViewDetailLevel
	Get
public:
property ViewDetailLevel DetailLevel {
	ViewDetailLevel get ();
}
member DetailLevel : ViewDetailLevel with get
Property Value
ViewDetailLevel
See Also
Reference
OverrideGraphicSettings Class
Autodesk.Revit.DB Namespace